//Создайте переменную a.
//Запишите в нее значение 10,выведите его на экран с помощью метода alert().
//Затем запишите в нeе же значение 20, выведите его на экран.//
let a = 10;
alert (a);
let a = 20;
alert (a);

//Задание 2 Создайте переменную и присвойте ей значение
//  года выпуска первого iPhone.
//  Выведите значение переменной на экран.//
let startIphone = 2007;
alert (startIphone);

//Задание 3 Создайте переменную и присвойте ей значение имени создателя языка JavaScript.
//  Выведите значение переменной на экран.//
let name = `Brendan Eich`;
alert (name);

//Задание 4 Создайте две переменные: 10 и 2.
//  С помощью метода alert() выведите на экран их сумму,
//  разность, произведение и частное (результат деления).//
let a = 10;
let b = 2;

